Repository: canbyte0/MacSSH
Catalog: MacSSH/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# accessibility.host_key_changed_dialog
source: Host key changed warning dialog
zh_hans: 主机密钥已更改警告对话框

# accessibility.host_trust_dialog
source: Host trust verification dialog
zh_hans: 主机信任验证对话框

# accessibility.hosts_sidebar
source: Hosts sidebar
zh_hans: 主机侧栏

# accessibility.macssh_workspace
source: MacSSH workspace
zh_hans: MacSSH 工作区

# accessibility.main_sidebar
source: Main sidebar
zh_hans: 主侧栏

# accessibility.selected
source: Selected
zh_hans: 已选中

# accessibility.terminal_tabs
source: Terminal tabs
zh_hans: 终端标签栏

# action.add
source: Add
zh_hans: 添加

# action.cancel
source: Cancel
zh_hans: 取消

# action.choose
source: Choose…
zh_hans: 选择…

# action.clear
source: Clear
zh_hans: 清除

# action.close
source: Close
zh_hans: 关闭

# action.connect
source: Connect
zh_hans: 连接

# action.create
source: Create
zh_hans: 创建

# action.delete
source: Delete
zh_hans: 删除

# action.disconnect
source: Disconnect
zh_hans: 断开连接

# action.download
source: Download
zh_hans: 下载

# action.edit
source: Edit
zh_hans: 编辑

# action.ok
source: OK
zh_hans: 好

# action.reconnect
source: Reconnect
zh_hans: 重新连接

# action.refresh
source: Refresh
zh_hans: 刷新

# action.rename
source: Rename
zh_hans: 重命名

# action.retry
source: Retry
zh_hans: 重试

# action.save
source: Save
zh_hans: 保存

# action.upload
source: Upload
zh_hans: 上传

# agent.context.local
source: Local
zh_hans: 本地

# agent.context.unavailable
source: Session unavailable
zh_hans: 会话不可用

# agent.empty.subtitle
source: Ask anything — the Agent can read the terminal context and files under the current directory (read-only). It cannot run commands.
zh_hans: 随时提问——Agent 可读取终端上下文与当前目录中的文件（只读），但不会执行任何命令。

# agent.empty.title
source: Ask about this terminal
zh_hans: 询问当前终端

# agent.error.generic
source: Unable to generate response.
zh_hans: 无法生成回复。

# agent.error.no_session
source: No active terminal session.
zh_hans: 没有可用的终端会话。

# agent.input.placeholder
source: Ask Agent…
zh_hans: 向 Agent 提问…

# agent.provider.error.authentication
source: Authentication failed. Check your API Key.
zh_hans: 认证失败。请检查 API Key。

# agent.provider.error.forbidden
source: The AI service rejected the request.
zh_hans: AI 服务拒绝了该请求。

# agent.provider.error.incomplete
source: The response was cut off before completion. Try again or simplify your request.
zh_hans: 回复在完成前被截断，请重试或简化请求。

# agent.provider.error.invalid_response
source: The AI service returned an unreadable response.
zh_hans: AI 服务返回了无法解析的响应。

# agent.provider.error.missing_credential
source: AI service is not configured. Add an API Key in Settings.
zh_hans: 尚未配置 AI 服务。请在设置中添加 API Key。

# agent.provider.error.network
source: Network error. Check your connection.
zh_hans: 网络错误。请检查网络连接。

# agent.provider.error.rate_limit
source: Rate limit reached. Try again later.
zh_hans: 请求频率过高，请稍后再试。

# agent.provider.error.server
source: The AI service had a problem. Try again later.
zh_hans: AI 服务出现问题，请稍后再试。

# agent.provider.error.session_unavailable
source: The terminal session is no longer available.
zh_hans: 终端会话已不可用。

# agent.provider.error.tool_round_limit
source: The agent stopped after reaching the tool round limit. Try simplifying your request.
zh_hans: 智能助手已达到工具轮次上限并停止。请尝试简化请求。

# agent.provider.not_configured
source: AI service is not configured. Add an API Key in Settings.
zh_hans: 尚未配置 AI 服务。请在设置中添加 API Key。

# agent.role.assistant
source: Agent
zh_hans: 智能助手

# agent.role.system
source: System
zh_hans: 系统

# agent.role.user
source: You
zh_hans: 我

# agent.send
source: Send
zh_hans: 发送

# agent.settings.api_key.action_failed_message
source: Saving or deleting the API Key failed. Please try again.
zh_hans: API Key 保存或删除失败，请重试。

# agent.settings.api_key.action_failed_title
source: Keychain Error
zh_hans: 钥匙串错误

# agent.settings.api_key.configured
source: Configured
zh_hans: 已配置

# agent.settings.api_key.delete
source: Delete
zh_hans: 删除

# agent.settings.api_key.help
source: The API Key is stored in the macOS Keychain and never displayed back. The Agent can read the terminal context and files under the current directory (read-only). It cannot run commands.
zh_hans: API Key 保存在 macOS 钥匙串中，保存后不再回显。Agent 可读取终端上下文与当前目录中的文件（只读），但不会执行任何命令。

# agent.settings.api_key.not_configured
source: Not configured
zh_hans: 未配置

# agent.settings.api_key.placeholder
source: Enter API Key
zh_hans: 输入 API Key

# agent.settings.api_key.save
source: Save
zh_hans: 保存

# agent.settings.api_key.status
source: Status
zh_hans: 状态

# agent.settings.base_url_invalid
source: Enter a valid http(s) URL.
zh_hans: 请输入合法的 http(s) URL。

# agent.settings.model
source: Model
zh_hans: 模型

# agent.settings.model.placeholder
source: Model ID
zh_hans: 模型 ID

# agent.settings.provider
source: Provider
zh_hans: 服务商

# agent.stop
source: Stop
zh_hans: 停止

# agent.title
source: Agent
zh_hans: 智能助手

# agent.tool.get_current_directory
source: Get current directory
zh_hans: 获取当前目录

# agent.tool.get_terminal_context
source: Read terminal context
zh_hans: 读取终端上下文

# agent.tool.list_directory
source: List directory
zh_hans: 列出目录

# agent.tool.read_file
source: Read file
zh_hans: 读取文件

# agent.tool.status.cancelled
source: Cancelled
zh_hans: 已取消

# agent.tool.status.failure
source: Failed
zh_hans: 失败

# agent.tool.status.running
source: Running
zh_hans: 进行中

# agent.tool.status.success
source: Done
zh_hans: 完成

# agent.tool.unknown
source: Tool call
zh_hans: 工具调用

# authentication.password
source: Password
zh_hans: 密码

# authentication.private_key
source: Private Key
zh_hans: 私钥

# common.none
source: None
zh_hans: 无

# common.on
source: On
zh_hans: 开

# common.save
source: Save
zh_hans: 保存

# error.keychain.access_denied
source: macOS Keychain denied access to the credential.
zh_hans: macOS Keychain 拒绝访问凭据。

# error.keychain.decoding
source: The stored credential could not be decoded.
zh_hans: 无法解码已存储的凭据。

# error.keychain.duplicate
source: A credential with this identifier already exists.
zh_hans: 已存在相同标识符的凭据。

# error.keychain.empty
source: The credential cannot be empty.
zh_hans: 凭据不能为空。

# error.keychain.encoding
source: The credential could not be prepared for secure storage.
zh_hans: 无法准备凭据以进行安全存储。

# error.keychain.interaction_not_allowed
source: macOS Keychain interaction is not currently allowed.
zh_hans: 当前不允许 macOS Keychain 交互。

# error.keychain.item_not_found
source: The credential was not found in macOS Keychain.
zh_hans: 在 macOS Keychain 中找不到凭据。

# error.keychain.unavailable
source: macOS Keychain is currently unavailable.
zh_hans: macOS Keychain 当前不可用。

# error.keychain.unexpected
source: The credential operation could not be completed.
zh_hans: 无法完成凭据操作。

# error.operation_cancelled
source: The operation was cancelled.
zh_hans: 操作已取消。

# error.operation_failed
source: The operation could not be completed.
zh_hans: 无法完成操作。

# error.remote.channel_open
source: The server refused to open a terminal channel.
zh_hans: 服务器拒绝打开终端通道。

# error.remote.closed
source: The remote terminal channel is closed.
zh_hans: 远程终端通道已关闭。

# error.remote.pty
source: The server refused to allocate a pseudo-terminal.
zh_hans: 服务器拒绝分配伪终端。

# error.remote.read
source: The terminal connection was interrupted while receiving output.
zh_hans: 接收输出时终端连接被中断。

# error.remote.resize
source: The remote terminal could not be resized.
zh_hans: 无法调整远程终端尺寸。

# error.remote.shell
source: The server refused to start a remote shell.
zh_hans: 服务器拒绝启动远程 Shell。

# error.remote.write
source: Input could not be delivered to the remote terminal.
zh_hans: 输入无法发送到远程终端。

# error.sftp.active_transfer
source: This file is being transferred, so the operation was blocked.
zh_hans: 该文件正在传输，操作已被阻止。

# error.sftp.invalid_name
source: The name cannot be empty, contain /, or be . or ....
zh_hans: 名称不能为空、包含 / 或为 . 或 ..。

# error.sftp.no_such_path
source: This folder no longer exists on the server.
zh_hans: 该文件夹在服务器上已不存在。

# error.sftp.operation_connection_lost
source: The SSH connection was lost.
zh_hans: SSH 连接已丢失。

# error.sftp.operation_permission
source: You do not have permission to complete this operation.
zh_hans: 没有权限完成该操作。

# error.sftp.operation_rejected
source: The operation failed. The destination name may already exist, or the server refused it.
zh_hans: 操作失败。目标名称可能已存在，或服务器拒绝了该操作。

# error.sftp.permission_denied
source: You do not have permission to view this folder.
zh_hans: 没有权限查看该文件夹。

# error.sftp.protocol
source: The SFTP server reported an error.
zh_hans: SFTP 服务器报告了错误。

# error.sftp.regular_file_only
source: Only regular files can be deleted.
zh_hans: 只能删除普通文件。

# error.sftp.stale_target
source: The item is no longer in this folder. Refresh and try again.
zh_hans: 该项目已不在该文件夹。请刷新后重试。

# error.sftp.subsystem
source: The server could not open an SFTP session.
zh_hans: 服务器无法打开 SFTP 会话。

# error.sftp.target_missing
source: The item does not exist. Refresh and try again.
zh_hans: 该项目不存在。请刷新后重试。

# error.sftp.unavailable
source: The SFTP session is unavailable.
zh_hans: SFTP 会话不可用。

# error.ssh.authentication
source: Authentication failed. Check your username and password.
zh_hans: 认证失败。请检查用户名与密码。

# error.ssh.cancelled
source: The connection was cancelled.
zh_hans: 连接已取消。

# error.ssh.connection_lost
source: The SSH connection was lost.
zh_hans: SSH 连接已丢失。

# error.ssh.credential_missing
source: No saved password was found for this host. Save a password before connecting.
zh_hans: 未找到该主机保存的密码。连接前请先保存密码。

# error.ssh.disconnect_cleanup
source: The connection closed, but the SSH session could not be cleaned up cleanly.
zh_hans: 连接已关闭，但 SSH 会话未能完全清理。

# error.ssh.dns
source: The server address could not be resolved. Check the hostname and your network.
zh_hans: 无法解析服务器地址。请检查主机名与网络。

# error.ssh.handshake
source: The SSH handshake failed. The server may not be a compatible SSH server.
zh_hans: SSH 握手失败。服务器可能不是兼容的 SSH 服务器。

# error.ssh.host_key_changed
source: The server's host key has changed. The connection was blocked to protect against a possible man-in-the-middle attack.
zh_hans: 服务器主机密钥已更改。为防范可能的中间人攻击，连接已被阻断。

# error.ssh.host_key_unavailable
source: The server identity could not be read after the handshake.
zh_hans: 握手后无法读取服务器身份。

# error.ssh.invalid_host
source: Please check the host name and username before connecting.
zh_hans: 连接前请核对主机名与用户名。

# error.ssh.known_host_save
source: The trusted host key could not be saved, so the connection was closed before signing in. Please try again.
zh_hans: 无法保存已信任的主机密钥，因此连接在登录前已关闭。请重试。

# error.ssh.network
source: A network error occurred while connecting to the server.
zh_hans: 连接服务器时发生网络错误。

# error.ssh.passphrase_incorrect
source: The saved passphrase is incorrect and could not decrypt the private key.
zh_hans: 已保存的密钥短语不正确，无法解密私钥。

# error.ssh.passphrase_required
source: This private key requires a passphrase, but none is saved. Save a passphrase before connecting.
zh_hans: 该私钥需要密钥短语，但未保存。连接前请保存密钥短语。

# error.ssh.password_unsupported
source: This server does not support password authentication.
zh_hans: 该服务器不支持密码认证。

# error.ssh.private_key_authentication
source: Private key authentication was rejected by the server. Check that the key is authorized.
zh_hans: 私钥认证被服务器拒绝。请确认该密钥已被授权。

# error.ssh.private_key_missing
source: No private key file is configured for this host. Choose a private key before connecting.
zh_hans: 该主机未配置私钥文件。连接前请选择私钥。

# error.ssh.private_key_not_found
source: The configured private key file could not be found. It may have been moved or deleted.
zh_hans: 找不到已配置的私钥文件。它可能已被移动或删除。

# error.ssh.private_key_unreadable
source: The private key file exists but could not be read. Check its file permissions.
zh_hans: 私钥文件存在但无法读取。请检查其文件权限。

# error.ssh.public_key_unsupported
source: This server does not support public key authentication.
zh_hans: 该服务器不支持公钥认证。

# error.ssh.refused
source: The connection was refused. No SSH server is listening on this port.
zh_hans: 连接被拒绝。该端口上没有 SSH 服务器在监听。

# error.ssh.session_init
source: The SSH session could not be created.
zh_hans: 无法创建 SSH 会话。

# error.ssh.timeout
source: The connection timed out. The server or network may be unreachable.
zh_hans: 连接超时。服务器或网络可能不可达。

# error.ssh.trust_rejected
source: The connection was cancelled because the server identity was not trusted.
zh_hans: 由于服务器身份未受信任，连接已取消。

# error.transfer.cancelled
source: The transfer was cancelled.
zh_hans: 传输已取消。

# error.transfer.connection_lost
source: The SSH connection was lost and the transfer failed.
zh_hans: SSH 连接已断开，传输失败。

# error.transfer.connection_lost_residue
source: The SSH connection was lost and the transfer failed. A temporary file may remain on the server: %@. You can clean it up manually later.
zh_hans: SSH 连接已断开，传输失败。远端可能残留临时文件 %@，可稍后手动清理。

# error.transfer.download_conflict
source: A task downloading to the same local destination is already in the queue.
zh_hans: 队列中已有相同本地目标文件的传输任务。

# error.transfer.download_regular_file_only
source: Only regular files can be downloaded.
zh_hans: 仅支持下载普通文件。

# error.transfer.local_read_failed
source: The local file could not be read.
zh_hans: 无法读取本地文件。

# error.transfer.local_write_failed
source: The local temporary file could not be written.
zh_hans: 无法写入本地临时文件。

# error.transfer.permission_denied
source: Permission denied; the transfer could not be completed.
zh_hans: 权限不足，无法完成传输。

# error.transfer.publish_failed
source: Replacing the destination file failed.
zh_hans: 替换目标文件失败。

# error.transfer.queue_full
source: The transfer queue is full. Please wait for some tasks to finish.
zh_hans: 传输队列已满，请等待部分任务完成。

# error.transfer.remote_file_exists
source: A file with the same name already exists on the server and will not be overwritten.
zh_hans: 远程文件已存在，不会自动覆盖该文件。

# error.transfer.remote_file_missing
source: The remote file no longer exists.
zh_hans: 远程文件已不存在。

# error.transfer.remote_protocol_error
source: The server reported a protocol error during the transfer.
zh_hans: 服务器报告了协议错误，传输失败。

# error.transfer.remote_write_failed
source: The server reported an error while writing data.
zh_hans: 服务器写入异常。

# error.transfer.session_missing
source: The session no longer exists.
zh_hans: 会话不存在。

# error.transfer.session_unavailable
source: The current session is unavailable.
zh_hans: 当前会话不可用。

# error.transfer.upload_conflict
source: A task uploading to the same remote destination is already in the queue.
zh_hans: 队列中已有相同远端目标的上传任务。

# error.transfer.upload_regular_file_only
source: Only regular files can be uploaded.
zh_hans: 只能上传普通文件。

# error.transfer.verification_failed
source: Transfer verification failed; the byte count does not match.
zh_hans: 传输校验失败，字节数不一致。

# files.title
source: Files
zh_hans: 文件

# groups.delete
source: Delete Group
zh_hans: 删除分组

# groups.delete_failed
source: The group could not be deleted.
zh_hans: 无法删除分组。

# groups.delete_message
source: Hosts in this group will be moved to All Hosts. This action cannot be undone.
zh_hans: 该分组下的主机会移动到全部主机。此操作无法撤销。

# groups.delete_title
source: Delete Group?
zh_hans: 删除分组？

# groups.duplicate_name
source: A group with this name may already exist.
zh_hans: 可能已存在同名分组。

# groups.new
source: New Group
zh_hans: 新建分组

# groups.rename
source: Rename Group
zh_hans: 重命名分组

# groups.save_failed_message
source: The group could not be saved.
zh_hans: 无法保存分组。

# groups.save_failed_title
source: Save failed
zh_hans: 保存失败

# groups.singular
source: Group
zh_hans: 分组

# groups.title
source: Groups
zh_hans: 分组

# host.disconnect.sessions_message
source: This will close %lld terminal session(s) connected to %@.
zh_hans: 这将关闭 %lld 个连接到%@的终端会话。

# host.disconnect.title
source: Disconnect host?
zh_hans: 断开主机连接？

# host.field.host
source: Host
zh_hans: 主机

# host.field.port
source: Port
zh_hans: 端口

# host.generic_name
source: the host
zh_hans: 该主机

# host_editor.authentication
source: Authentication
zh_hans: 认证方式

# host_editor.choose_private_key_title
source: Choose Private Key File
zh_hans: 选择私钥文件

# host_editor.group
source: Group
zh_hans: 分组

# host_editor.hostname
source: Hostname
zh_hans: 主机名

# host_editor.keychain_cleanup_failed
source: The host was not saved and macOS Keychain cleanup also failed. Please retry.
zh_hans: 主机未保存，且 macOS Keychain 清理也失败。请重试。

# host_editor.name
source: Name
zh_hans: 名称

# host_editor.new_passphrase
source: New Passphrase
zh_hans: 新密钥短语

# host_editor.new_password
source: New Password
zh_hans: 新密码

# host_editor.no_file_chosen
source: No file chosen
zh_hans: 未选择文件

# host_editor.notes
source: Notes
zh_hans: 备注

# host_editor.passphrase
source: Passphrase
zh_hans: 密钥短语

# host_editor.passphrase_keep_hint
source: Leave the field empty to keep the current passphrase.
zh_hans: 留空字段以保留当前密钥短语。

# host_editor.passphrase_optional_hint
source: Leave the passphrase empty if your private key is not protected.
zh_hans: 私钥未加密时请留空密钥短语。

# host_editor.passphrase_remove_on_save
source: Passphrase will be removed on save
zh_hans: 保存时将移除密钥短语

# host_editor.passphrase_stored
source: Passphrase saved
zh_hans: 密钥短语已保存

# host_editor.password
source: Password
zh_hans: 密码

# host_editor.password_keep_hint
source: Leave the field empty to keep the current password.
zh_hans: 留空字段以保留当前密码。

# host_editor.password_remove_on_save
source: Password will be removed on save
zh_hans: 保存时将移除密码

# host_editor.password_storage_hint
source: The password will be stored securely in macOS Keychain.
zh_hans: 密码将安全保存在 macOS Keychain。

# host_editor.password_stored
source: Password saved
zh_hans: 密码已保存

# host_editor.port
source: Port
zh_hans: 端口

# host_editor.private_key_hint
source: Choose a private key file for SSH public key authentication.
zh_hans: 为 SSH 公钥认证选择私钥文件。

# host_editor.remove_saved_passphrase
source: Remove Saved Passphrase
zh_hans: 移除已保存的密钥短语

# host_editor.remove_saved_password
source: Remove Saved Password
zh_hans: 移除已保存的密码

# host_editor.save_failed_message
source: The host could not be saved.
zh_hans: 无法保存主机。

# host_editor.save_failed_title
source: Save failed
zh_hans: 保存失败

# host_editor.section.authentication
source: Authentication
zh_hans: 认证

# host_editor.section.host
source: Host
zh_hans: 主机

# host_editor.section.organization
source: Organization
zh_hans: 组织

# host_editor.swiftdata_save_failed
source: SwiftData could not save the host. Please try again.
zh_hans: SwiftData 无法保存主机。请重试。

# host_editor.username
source: Username
zh_hans: 用户名

# host_key_changed.confirm_message
source: The saved host key will be deleted and replaced with the new key shown above. This will allow future connections to proceed.
zh_hans: 已保存的主机密钥将被删除并替换为上方显示的新密钥。后续连接将基于新密钥进行。

# host_key_changed.confirm_replace
source: Replace
zh_hans: 替换

# host_key_changed.confirm_title
source: Replace Trusted Key?
zh_hans: 替换受信任密钥？

# host_key_changed.message
source: The server's host key differs from the saved identity. This may indicate a man-in-the-middle attack or a reinstalled server. Verify with your administrator before continuing.
zh_hans: 服务器主机密钥与已保存身份不一致。这可能意味着中间人攻击或服务器重装。继续之前请与您的管理员核实。

# host_key_changed.new_fingerprint
source: New Fingerprint
zh_hans: 新指纹

# host_key_changed.old_fingerprint
source: Old Fingerprint
zh_hans: 原指纹

# host_key_changed.replace
source: Replace Trusted Key
zh_hans: 替换受信任密钥

# host_key_changed.title
source: Host Key Changed
zh_hans: 主机密钥已更改

# host_trust.choice_explanation
source: Trust Once connects only this time. Trust Always saves the identity for future connections. Cancel disconnects.
zh_hans: 仅本次信任只连接本次。始终信任会保存身份以便后续连接。取消即断开。

# host_trust.fingerprint
source: Fingerprint
zh_hans: 指纹

# host_trust.key_type
source: Key Type
zh_hans: 密钥类型

# host_trust.message
source: The authenticity of this host could not be verified. Compare the fingerprint below before continuing.
zh_hans: 无法验证该主机的真实性。继续之前请核对下方指纹。

# host_trust.title
source: Verify Host Identity
zh_hans: 验证主机身份

# host_trust.trust_always
source: Trust Always
zh_hans: 始终信任

# host_trust.trust_once
source: Trust Once
zh_hans: 仅本次信任

# hosts.add
source: Add Host
zh_hans: 添加主机

# hosts.add_favorite
source: Add to Favorites
zh_hans: 添加到收藏

# hosts.add_help
source: Add a new host or host group.
zh_hans: 添加新的主机或主机分组。

# hosts.all
source: All Hosts
zh_hans: 全部主机

# hosts.count.one
source: 1 Host
zh_hans: 1 个主机

# hosts.count.other
source: %lld Hosts
zh_hans: %lld 个主机

# hosts.delete
source: Delete Host
zh_hans: 删除主机

# hosts.delete_failed
source: The host could not be deleted. Please try again.
zh_hans: 无法删除该主机。请重试。

# hosts.delete_keychain_restore_failed
source: The host was not deleted and macOS Keychain restoration also failed. Please retry.
zh_hans: 主机未删除，且 macOS Keychain 恢复也失败。请重试。

# hosts.delete_message
source: This will remove the host and any saved credentials. This action cannot be undone.
zh_hans: 此操作将删除该主机及其保存的凭据。此操作无法撤销。

# hosts.delete_title
source: Delete Host?
zh_hans: 删除主机？

# hosts.disconnect_all_help
source: Disconnect all terminal sessions for this host.
zh_hans: 断开该主机的全部终端会话。

# hosts.edit
source: Edit Host
zh_hans: 编辑主机

# hosts.edit_selected_help
source: Edit the selected host.
zh_hans: 编辑所选主机。

# hosts.empty
source: No Hosts
zh_hans: 没有主机

# hosts.empty_message
source: Add a host to connect and start a terminal session.
zh_hans: 添加主机以连接并开始终端会话。

# hosts.error_title
source: Operation failed
zh_hans: 操作失败

# hosts.favorite
source: Favorite
zh_hans: 收藏

# hosts.favorite_update_failed
source: Favorite could not be updated.
zh_hans: 无法更新收藏。

# hosts.favorites
source: Favorites
zh_hans: 收藏

# hosts.new
source: New Host
zh_hans: 新建主机

# hosts.open_new_terminal_help
source: Open a new terminal session for this host.
zh_hans: 为该主机打开新的终端会话。

# hosts.open_remote_terminal
source: Open Remote Terminal
zh_hans: 打开远程终端

# hosts.open_terminal
source: Open Terminal
zh_hans: 打开终端

# hosts.remove_favorite
source: Remove from Favorites
zh_hans: 从收藏移除

# hosts.search
source: Search hosts
zh_hans: 搜索主机

# hosts.search_empty_message
source: No hosts match your search.
zh_hans: 没有匹配搜索条件的主机。

# hosts.title
source: Hosts
zh_hans: 主机

# hosts.ungrouped
source: Ungrouped
zh_hans: 未分组

# known_hosts.empty_message
source: No trusted hosts yet.
zh_hans: 尚无已信任主机。

# known_hosts.forget
source: Forget
zh_hans: 移除信任

# known_hosts.forget_failed_message
source: The trusted host could not be removed. Please try again.
zh_hans: 无法移除已信任的主机。请重试。

# known_hosts.forget_failed_title
source: Could not forget host
zh_hans: 无法移除信任主机

# known_hosts.forget_message
source: Next time you connect, you will be asked to verify this host again.
zh_hans: 下次连接时将再次要求验证该主机。

# known_hosts.forget_title
source: Forget Host?
zh_hans: 移除信任主机？

# known_hosts.title
source: Known Hosts
zh_hans: 已知主机

# known_hosts.trusted_at
source: Trusted %@
zh_hans: 已信任于 %@

# menu.terminal
source: Terminal
zh_hans: 终端

# search.no_results
source: No Results
zh_hans: 无结果

# session.close.active_transfers
source: This SSH session has %lld file transfer tasks. Closing it will cancel active and waiting transfers.
zh_hans: 当前 SSH 会话有 %lld 个文件传输任务。关闭会话将取消相关传输并断开连接。

# session.close.disconnect_host
source: This will disconnect from %@.
zh_hans: 这将断开与%@的连接。

# session.close.title
source: Close SSH session?
zh_hans: 关闭 SSH 会话？

# settings.appearance.dark
source: Dark
zh_hans: 深色

# settings.appearance.light
source: Light
zh_hans: 浅色

# settings.appearance.system
source: Follow System
zh_hans: 跟随系统

# settings.confirm_before_closing_ssh
source: Confirm before closing SSH session
zh_hans: 关闭 SSH 会话前确认

# settings.connection_timeout
source: Connection timeout
zh_hans: 连接超时

# settings.connection_timeout_value
source: 15 seconds
zh_hans: 15 秒

# settings.font
source: Font
zh_hans: 字体

# settings.font_size
source: Font size
zh_hans: 字体大小

# settings.language
source: Language
zh_hans: 语言

# settings.launch_behavior
source: Launch behavior
zh_hans: 启动行为

# settings.mode
source: Mode
zh_hans: 模式

# settings.open_main_window
source: Open main window
zh_hans: 打开主窗口

# settings.paste_highlight
source: Highlight pasted text
zh_hans: 粘贴后高亮
